{"newspapers": {"cnn": {"link": "http://edition.cnn.com/", "articles": [{"title": "How to Watch VR", "text": "IN YOUR HEADSET...\n\nHeadsets are hands-down the best way to watch VR stories. You can see the latest from CNNVR on the Samsung VR app , the Oculus Video app on Rift , or on the CNNVR app on Google Daydream . Just look left or right to explore the 360 world around you. Believe us, you need to try this.", "link": "http://edition.cnn.com/2017/03/04/vr/how-to-watch-vr", "published": "2017-03-04T00:00:00"}]}, "breitbart": {"link": "http://www.breitbart.com/", "articles": []}, "infowars": {"link": "https://www.infowars.com/", "articles": [{"title": "Man Arrested Near White House Called For Assassinating Trump", "text": "A Texas man arrested by Secret Service near the White House today who planned to “kill all white police officers” also posted a death threat on his Facebook page aimed at President Trump.\n\nAccording to reports, Michael Arega traveled from Dallas to Washington DC with the intention to “kill all white police officers” at the White House.\n\nThat motive wasn’t exactly well hidden.\n\n“Now I am going there to White House make sure kill all white police!!” Arega posted on his Facebook page earlier today.\n\nThe United States Secret Service, the agency’s Protective Intelligence Division, received a BOLO warning (be on the lookout) from the Montgomery County, Maryland Police Department for Michael Arega at around 2:55pm.\n\nAfter security at the White House was tightened, the suspect was spotted on the north side of Pennsylvania Avenue near Lafayette Park just after 4pm and arrested without incident. He was then taken to D.C. Metropolitan Police Department where charges are pending.\n\nArega posted a stream of garbled posts on his Facebook page today, including a violent threat aimed at President Trump.\n\nIn response to an article about Trump’s comment that it was fortunate someone else at the scene of the Sutherland Springs church massacre had a gun to stop the mass shooter, Arega remarked above an image of Trump, “Kill Him in JESUS NAME!!”\n\nArega also checked into the White House on his Facebook page.\n\nSecret Service cleared people out from Lafayette Park outside the North Lawn of the White House just minutes ago — pic.twitter.com/9V6Pdmgg1X — J.D. Durkin (@jiveDurkey) November 6, 2017\n\nWas Arega another example of a lunatic radicalized by the hysterical anti-Trump sentiment that has swept the country, or is he just mentally deranged?\n\nSUBSCRIBE on YouTube:\n\nFollow on Twitter: Follow @PrisonPlanet\n\nFacebook: https://www.facebook.com/paul.j.watson.71\n\n*********************\n\nPaul Joseph Watson is the editor at large of Infowars.com and Prison Planet.com.", "link": "https://www.infowars.com/man-arrested-near-white-house-called-for-assassinating-trump/", "published": "2017-11-06T18:08:53-06:00"}, {"title": "Man Arrested Near White House Called For Assassinating Trump", "text": "A Texas man arrested by Secret Service near the White House today who planned to “kill all white police officers” also posted a death threat on his Facebook page aimed at President Trump.\n\nAccording to reports, Michael Arega traveled from Dallas to Washington DC with the intention to “kill all white police officers” at the White House.\n\nThat motive wasn’t exactly well hidden.\n\n“Now I am going there to White House make sure kill all white police!!” Arega posted on his Facebook page earlier today.\n\nThe United States Secret Service, the agency’s Protective Intelligence Division, received a BOLO warning (be on the lookout) from the Montgomery County, Maryland Police Department for Michael Arega at around 2:55pm.\n\nAfter security at the White House was tightened, the suspect was spotted on the north side of Pennsylvania Avenue near Lafayette Park just after 4pm and arrested without incident. He was then taken to D.C. Metropolitan Police Department where charges are pending.\n\nArega posted a stream of garbled posts on his Facebook page today, including a violent threat aimed at President Trump.\n\nIn response to an article about Trump’s comment that it was fortunate someone else at the scene of the Sutherland Springs church massacre had a gun to stop the mass shooter, Arega remarked above an image of Trump, “Kill Him in JESUS NAME!!”\n\nArega also checked into the White House on his Facebook page.\n\nSecret Service cleared people out from Lafayette Park outside the North Lawn of the White House just minutes ago — pic.twitter.com/9V6Pdmgg1X — J.D. Durkin (@jiveDurkey) November 6, 2017\n\nWas Arega another example of a lunatic radicalized by the hysterical anti-Trump sentiment that has swept the country, or is he just mentally deranged?\n\nSUBSCRIBE on YouTube:\n\nFollow on Twitter: Follow @PrisonPlanet\n\nFacebook: https://www.facebook.com/paul.j.watson.71\n\n*********************\n\nPaul Joseph Watson is the editor at large of Infowars.com and Prison Planet.com.", "link": "https://www.infowars.com/man-arrested-near-white-house-called-for-assassinating-trump/#disqus_thread", "published": "2017-11-06T18:08:53-06:00"}, {"title": "Texas National Guard Using Cellphone Spy Tech on Surveillance Planes", "text": "The Texas National Guard has added cellphone spying technology to its surveillance aircraft to assist the Drug Enforcement Administration (DEA) in counternarcotics operations.\n\nAccording to contract documents obtained by the Texas Observer’s Melissa del Bosque, the Texas National Guard spent over $373,000 last year on the controversial cell-site simulators.\n\nThe devices, purchased with drug-asset forfeiture money from Maryland-based Digital Receiver Technology Inc. (DRT), are designed to locate cellphones within a certain range by emulating a cell tower.\n\nThe specific model obtained by the Texas National Guard, known as the DRT 1301C, is even capable of intercepting and recording phone calls in real-time.\n\nA leaked U.S. government catalogue of cellphone surveillance devices obtained by The Intercept in 2015 also notes the ability of the DRT 1301C, nicknamed the “dirt box,” to “locate up to 10,000 targets and can process multiple analog and digital wireless devices all at the same time.”\n\nThe Observer notes that the dirt boxes were installed in two RC-26 surveillance planes used for counternarcotics operations.\n\nQuestions have now begun to arise over the legality of the Texas National Guard’s actions given their intended role and mission scope.\n\n“[T]he Texas National Guard is a military force under the governor’s command, not law enforcement,” del Bosque writes. “It’s unclear under what legal authorities the State Guard would be operating to conduct electronic eavesdropping.”\n\nWhen questioned by the Observer, the Texas National Guard reportedly refused to explain how or if it had obtained a warrant prior to using the devices.\n\nGovernment agencies who have purchased similar technology in the past have pointed to nondisclosure agreements with the manufacturers as reasoning for keeping knowledge of the devices hidden from the public.\n\nGiven the technology’s ability to gather wide swaths of data, civil liberties advocates fear that countless innocent cell phone users are being affected while the dirt boxes are in use.\n\n“These DRT boxes are far more capable than the old Stingrays,”Austin-based attorney Scott McCollough told the Observer. “The old-style Stingrays were not able to capture content. Guess what? The DRT box is… These newer ones get everything.”\n\nThe American Civil Liberties Union (ACLU) has found that law enforcement in at least 24 states is currently employing the technology.\n\nGot a tip? Contact Mikael securely: keybase.io/mikaelthalen\n\nFollow @MikaelThalen", "link": "https://www.infowars.com/texas-national-guard-using-cellphone-spy-tech-on-surveillance-planes/", "published": "2017-11-06T17:10:44-06:00"}]}, "foxnews": {"link": "http://www.foxnews.com/", "articles": [{"title": "Texas church shooter reportedly fractured stepson's skull on purpose", "text": "The gunman who opened fire in a Texas Baptist church on Sunday, killing at least 26 people, was once convicted of assault after he reportedly fractured his infant stepson’s skull.\n\nBefore 26-year-old Devin Kelley received a bad conduct discharge from the U.S. Air Force in 2014, he was court-martialed in 2012 for assaulting his ex-wife and child. Kelley struck his stepson so hard he fractured his skull.\n\n“He assaulted his stepson severely enough that he fractured his skull, and he also assaulted his wife,” retired colonel Don Christensen, formerly the chief prosecutor for the Air Force, told the The New York Times. “He pled to intentionally doing it.”\n\nAs punishment, Kelley was confined in military prison 12 months, received a reduction in military rank and was discharged for “bad conduct” -- a step above a dishonorable discharge.\n\nKelley, who was described to Fox News by a childhood friend as a “happy, caring person,” was separately charged in August 2014 for animal cruelty.\n\nHe had jumped on and repeatedly punched his pet Husky -- an underweight puppy -- while he was living in a trailer park in Colorado Springs, Colorado, KMGH reported. Kelley denied beating the dog and said he jumped on it because it was acting aggressively toward another dog.\n\nHe was also the focus of a protective order issued in Colorado in 2015.\n\nDEVIN PATRICK KELLEY SERVED IN AIR FORCE, WAS COURT-MARTIALED FOR ASSAULTING WIFE, CHILD\n\nAuthorities believe Kelley used a Ruger AR-556 rifle when he committed the deadliest shooting at a church in modern U.S. history. Authorities found that rifle at the church, while two handguns were recovered from Kelley’s vehicle.\n\nOfficials said hundreds of shell casings and 15 magazines with 30 rounds each were found at the church.\n\nAcademy Sports + Outdoors, a chain sporting goods store, told Fox News in a statement that Kelley had purchased two guns from two of their locations, both in San Antonio, on separate dates.\n\n“Based on information we received from law enforcement, we confirmed that the suspect purchased two firearms from two San Antonio locations, one in 2016 and one in 2017,\" the statement read. \"We also confirmed that both sales were approved by the National Instant Criminal Background Check System (NICS). We are cooperating with law enforcement as they investigate further.”\n\nThose who are given a bad conduct discharge from the military are not barred from legally purchasing weapons.\n\nA 1968 Gun Control Act made it unlawful for a licensed firearms deal to sell weapons to those who received a dishonorable discharge -- not a bad conduct discharge. Since Kelley was discharged on bad conduct, the law was not triggered.\n\nHowever, Texas Gov. Greg Abbott said Monday on “FOX & Friends” that Kelley was denied a gun permit in the state.\n\n\"He was rejected either because he did not fully answer all the questions that are required to get a Texas gun permit, or he answered those questions wrong, that we still don't know,\" Abbott said.\n\nFederal officials said Monday night that the Air Force didn't submit Kelley's domestic assault conviction into a national database that's used to conduct background checks, as required by the Pentagon.\n\nAn autopsy of Kelley's body found three gunshot wounds: one self-inflicted to the head and two -- one in the leg, another in the torso -- from the armed citizen who chased after him.\n\nFox News' Shira Bush and Madeline Farber and The Associated Press contributed to this report.", "link": "http://www.foxnews.com/us/2017/11/06/texas-church-shooter-reportedly-fractured-stepsons-skull-on-purpose.html", "published": "2017-11-06T00:00:00"}, {"title": "Anti-Trump media makes up fake story about overfeeding fish at Japanese koi pond", "text": "President Trump and Japan's Prime Minister Shinzo Abe carried on an old tradition of feeding carp at a Koi pond in Tokyo when CNN and the rest of the mainstream media decided to twist the narrative to make Trump appear like a buffoon.\n\nLiberal network CNN ran a ridiculous headline, “Trump feeds fish, winds up pouring entire box of food into Koi pond,” complete with a misleading tweet from reporter Veronica Rocha that only shows the Trump dumping the entire box of food. Her footage is conveniently edited to skip Abe doing the same thing.\n\nIN fact, Abe dumped his entire box of fish food into the pond and Trump followed while the Prime Minister of Japan smiled. However, the anti-Trump media has been cropping the video to only show Trump’s actions.\n\nBloomberg White House correspondent Justin Sink tweeted that Trump and Abe were “spooning fish food into the pond” when Trump “decided to just dump the whole box in for the fish.” The problem with the attempt to paint Trump as an animal-abusing, lazy America is that Japan's Prime Minister did the exact same thing seconds before.\n\nBuzzFeed News ran a story headlined, “This photo of Trump dumping his carp food in a pond in japan has become a huge meme,” and embedded a series of Japanese tweets mocking the president. The Guardian even ran a story about the dangers of overfeeding fish.\n\n“White House reporters, keen perhaps to pick up on a Trump gaffe, captured the moment when he upended his box on their smartphones and tweeted evidence of his questionable grasp of fish keeping,” The Guardian wrote. “Some speculated that a poor palace employee would be dispatched to the scene to clean up the mess as soon as the two leaders disappeared inside.”\n\nForeign dignitaries have been feeding the fish in the koi pond for years, but Trump did not lose patience, despite what the media wants the narrative to be. He was literally emulating Abe with his actions.\n\nOne Twitter user wrote, “Abe is basically watching in polite rage-horror as the epic orange buffoon tries to kill his fish,” but she clearly didn’t see the entire video, while the New York Daily News said, “The former New York City real estate tycoon got a little heavy handed while feeding koi.”\n\nBrian Flood covers the media for Fox News. Follow him on Twitter at @briansflood.\n\nDisplay nothing; This is on Publish with no configured Image", "link": "http://www.foxnews.com/entertainment/2017/11/06/anti-trump-media-makes-up-fake-story-about-overfeeding-fish-at-japanese-koi-pond.html", "published": "2017-11-06T00:00:00"}, {"title": "Model, 27, faces backlash for appearing to hit on 14-year-old 'Stranger Things' star", "text": "Ali Michael, a Texas-based model, has found herself in a social media firestorm after making a comment some deemed inappropriate on Instagram about 14-year-old \"Stranger Things\" actor Finn Wolfhard.\n\nA post shared by ALI MICHAEL (@ali_michael) on Oct 31, 2017 at 8:24am PDT\n\nThe 27-year-old model shared a picture of Wolfhard and wrote, \"Not to be weird but hit me up in 4 years @finnwolfhardofficial.\"\n\nThe image, which was posted in Michael's Instagram story, has since disappeared from her feed.\n\nThe social media universe was quick to question the comment about the child star.\n\n\n\nOn Twitter one person wrote, \"joking [about] children hitting puberty and sexualizing them as a way to invoke a funny rhetoric is (sick emojis).\"\n\nMichael apologized for her remark after the backlash.\n\n\"Hi, Yesterday I posted a picture of Mike from Stranger Things and wrote 'Call me in 4 years.' It was completely and absolutely a joke but I understand that people have been offended by it. It was wrong to joke about and I apologise. I do not want Mike from Stranger Things to call me. I hope this clears things up.\"\n\nBut some were not quick to forgive.\n\nOne user questioned if fans will \"just gonna forgive ali michael for being a pedophile...?\"\n\nA TMZ paparazzo caught up with Wolfhard and asked the star about Michael's comment.\n\nHe replied, \"Oh, that was nuts. That was gross.\"\n\nThe comments on Michael's Instagram account have been disabled since the backlash.", "link": "http://www.foxnews.com/entertainment/2017/11/06/model-27-faces-backlash-for-appearing-to-hit-on-14-year-old-stranger-things-star.html", "published": "2017-11-06T00:00:00"}]}, "nbcnews": {"link": "http://www.nbcnews.com/", "articles": []}, "theonion": {"link": "http://www.theonion.com/", "articles": []}, "reuters": {"link": "http://www.reuters.com/", "articles": []}}}